Enums/ТипыОснованияАктаОРасхождении.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыОснованияАктаОРасхождении</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РеализацияТоваровУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриобретениеТоваровУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратТоваровОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаТоваровСХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаТоваровХранителю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаТоваровНаХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратТоваровОтХранителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаТоваровПереработчику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратТоваровОтПереработчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеТоваровОтПереработчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтДавальца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаДавальцу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДавальцу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтКомиссионера</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыАктаОРасхождениях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтатусыАктаОРасхождениях</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеСогласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отработано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыОтраженияАктовОРасхожденияПослеПоступления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СпособыОтраженияАктовОРасхожденияПослеПоступления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИсправлениеПервичныхДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеКорректировокПоступления</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыОтраженияРасхожденийАктПриемкиКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СпособыОтраженияРасхожденийАктПриемкиКлиента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОформлениеКорректировкиКакИсправлениеПервичныхДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеКорректировокКакНовыеПервичныеДокументы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсправлениеПервичныхДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеКорректировкиПоСогласованию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыДействийПоРасхождениямВАктеПослеОтгрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПокупкаПерепоставленного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПерепоставленного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерепоставленноеДарится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопоставкаНеТребуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяДопоставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НедостачаНеПризнана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузитьСейчас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОприходоватьСейчас</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыДействийПоРасхождениямВАктеПослеПриемки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыДействийПоРасхождениямВАктеПослеПриемки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВернутьПерепоставленноеБезОформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтнестиПерепоставленноеНаПрочиеДоходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформитьПерепоставленноеИВернуть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформитьПерепоставленное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформитьНедостачу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформитьНедостачуИОжидатьДопоставку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтнестиНедостачуНаПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидатьДопоставкуБезОформления</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СделкиСКлиентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>СделкиСКлиентами</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Document.Встреча</xr:Item>
				<xr:Item>Catalog.Партнеры</xr:Item>
				<xr:Item>Document.ЭлектронноеПисьмоВходящее</xr:Item>
				<xr:Item>Document.ЭлектронноеПисьмоИсходящее</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаПервичногоСпроса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВероятностьУспешногоЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСделокСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереведенаНаУправлениеВРучную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПотенциальнаяСуммаПродажи</Name>
					<Comment>Потенциальная сумма продажи в валюте управленческого учета</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПроигрышаСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныПроигрышаСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоглашениеСКлиентом</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленныйУчетТоваровПоСделке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПартнерыИКонтактныеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольПартнера</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиПартнеровВСделкахИПроектах</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольКонтактногоЛица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиКонтактныхЛицВСделкахИПроектах</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыигралСделку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПервичныйСпрос</Name>
					<Comment>Первичный спрос клиента</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТекстовоеОписание</Name>
							<Comment>Краткое описание номенклатуры, в которой была выражена заинтересованность</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентУдовлетворения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаНеудовлетворения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныНеудовлетворенияПервичногоСпроса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/РасхожденияКлиентСервер/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль "РасхожденияКлиентСервер" содержит процедуры и функции, работающие на клиенте и сервер
// для работы документов отражения расхождений после отгрузки.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция ТипОснованияРеализацияТоваровУслуг(ТипОснованияАктаОРасхождении) Экспорт
	
	Возврат ТипОснованияАктаОРасхождении = ПредопределенноеЗначение("Перечисление.ТипыОснованияАктаОРасхождении.РеализацияТоваровУслуг")
	        ИЛИ ТипОснованияАктаОРасхождении = ПредопределенноеЗначение("Перечисление.ТипыОснованияАктаОРасхождении.ПустаяСсылка");
	
КонецФункции

Функция ТипОснованияПередачаТоваровХранителю(ТипОснованияАктаОРасхождении) Экспорт
	
	ТипыОснованияАкта = Новый Массив;
	ТипыОснованияАкта.Добавить(
		ПредопределенноеЗначение("Перечисление.ТипыОснованияАктаОРасхождении.ПередачаТоваровХранителю"));
	
	Возврат ТипыОснованияАкта.Найти(ТипОснованияАктаОРасхождении) <> Неопределено;
	
КонецФункции

Функция ТипОснованияПередачаНаКомиссию(ТипОснованияАктаОРасхождении) Экспорт
	
	Возврат ТипОснованияАктаОРасхождении = ПредопределенноеЗначение("Перечисление.ТипыОснованияАктаОРасхождении.ПередачаНаКомиссию");
	
КонецФункции

Функция ТипОснованияПоступлениеТоваровОтХранителя(ТипОснованияАктаОРасхождении) Экспорт
	
	ТипыОснованияАкта = ТипыОснованияПоступлениеТоваровОтХранителя();
	
	Возврат ТипыОснованияАкта.Найти(ТипОснованияАктаОРасхождении) <> Неопределено;
	
КонецФункции

Функция ТипОснованияПриобретениеТоваровУслуг(ТипОснованияАктаОРасхождении) Экспорт
	
	Возврат ТипОснованияАктаОРасхождении = ПредопределенноеЗначение("Перечисление.ТипыОснованияАктаОРасхождении.ПриобретениеТоваровУслуг");
	
КонецФункции

Функция ТипОснованияВозвратТоваровОтКлиента(ТипОснованияАктаОРасхождении) Экспорт
	
	Возврат ТипОснованияАктаОРасхождении =
		ПредопределенноеЗначение("Перечисление.ТипыОснованияАктаОРасхождении.ВозвратТоваровОтКлиента");
	
КонецФункции

Функция ТипОснованияВозвратПоставщику(ТипОснованияАктаОРасхождении) Экспорт
	
	Возврат ТипОснованияАктаОРасхождении =
		ПредопределенноеЗначение("Перечисление.ТипыОснованияАктаОРасхождении.ВозвратПоставщику");
	
КонецФункции

Функция ТипОснованияОтгрузкаТоваровСХранения(ТипОснованияАктаОРасхождении) Экспорт
	
	Возврат ТипОснованияАктаОРасхождении =
		ПредопределенноеЗначение("Перечисление.ТипыОснованияАктаОРасхождении.ОтгрузкаТоваровСХранения");
	
КонецФункции

Функция ТипОснованияПеремещениеТоваров(ДокументСсылка) Экспорт
	
	Возврат ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.АктОРасхожденияхПослеПеремещения");
	
КонецФункции

Функция ТипыОснованияПоступлениеТоваровОтХранителя() Экспорт
	
	ТипыОснования = Новый Массив;
	ТипыОснования.Добавить(
		ПредопределенноеЗначение("Перечисление.ТипыОснованияАктаОРасхождении.ВозвратТоваровОтХранителя"));
	ТипыОснования.Добавить(
		ПредопределенноеЗначение("Перечисление.ТипыОснованияАктаОРасхождении.ВозвратОтКомиссионера"));
	
	Возврат ТипыОснования;
	
КонецФункции

Функция ТипОснованияВозвратОтКомиссионера(ТипОснованияАктаОРасхождении) Экспорт
	
	Возврат ТипОснованияАктаОРасхождении = ПредопределенноеЗначение("Перечисление.ТипыОснованияАктаОРасхождении.ВозвратОтКомиссионера");
	
КонецФункции

Функция УчетНДСНеВедется(ТипОснованияАктаОРасхождении) Экспорт
	
	ТипыОснования = Новый Массив;
	ТипыОснования.Добавить(
		ПредопределенноеЗначение("Перечисление.ТипыОснованияАктаОРасхождении.ОтгрузкаТоваровСХранения"));
	ТипыОснования.Добавить(
		ПредопределенноеЗначение("Перечисление.ТипыОснованияАктаОРасхождении.ПриемкаТоваровНаХранение"));
	
	Возврат ТипыОснования.Найти(ТипОснованияАктаОРасхождении) <> Неопределено;
	
КонецФункции

Функция РассчитатьИтоговыеКоличественныеПоказателиФормы(ТаблицаТовары) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Недостачи", 0);
	Результат.Вставить("Излишки", 0);
	Результат.Вставить("Расхождения", 0);
	Результат.Вставить("СтрокСРасхождениями", 0);
	
	Результат.Недостачи = 0;
	Результат.Излишки   = 0;
	
	Для Каждого СтрокаТовары Из ТаблицаТовары Цикл
		
		Если СтрокаТовары.КоличествоУпаковокРасхождения <> 0 Тогда
			Результат.СтрокСРасхождениями = Результат.СтрокСРасхождениями + 1;
		КонецЕсли;
		
		Если СтрокаТовары.КоличествоУпаковокРасхождения > 0 Тогда
			Результат.Излишки = Результат.Излишки + СтрокаТовары.КоличествоУпаковокРасхождения;
		ИначеЕсли СтрокаТовары.КоличествоУпаковокРасхождения < 0 Тогда
			Результат.Недостачи = Результат.Недостачи + (-СтрокаТовары.КоличествоУпаковокРасхождения);
		КонецЕсли;
		
	КонецЦикла;
	
	Результат.Вставить("ЕстьИзлишки", Результат.Излишки > 0);
	Результат.Вставить("ЕстьНедостачи", Результат.Недостачи > 0);
	
	Результат.Расхождения = ТаблицаТовары.Итог("Количество") - ТаблицаТовары.Итог("КоличествоПоДокументу");
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураДействийПриИзмененииКоличестваУпаковок() Экспорт

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьРасхождения");

	Возврат СтруктураДействий;

КонецФункции

Функция СтруктураДействийЗаполнитьЗависимыеРеквизитыТоваров() Экспорт

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьРасхождения");
	СтруктураДействий.Вставить("УстановитьПризнакДляЗаполненияТекстовогоОписания");
	СтруктураДействий.Вставить("ПризнакНаличиеКомментария");

	Возврат СтруктураДействий;

КонецФункции

Функция СтруктураДействийЗаполнитьЗависимыеРеквизитыТоваровРасхожденияПослеОтгрузки() Экспорт

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьРасхожденияПослеОтгрузки");
	СтруктураДействий.Вставить("УстановитьПризнакДляЗаполненияТекстовогоОписания");
	СтруктураДействий.Вставить("ПризнакНаличиеКомментарияОтгрузка");

	Возврат СтруктураДействий;

КонецФункции

Функция СтруктураДействийЗаполнитьЗависимыеРеквизитыТоваровРасхожденияПослеПриемки() Экспорт

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьРасхожденияПослеПриемки");
	СтруктураДействий.Вставить("ПризнакНаличиеКомментарияПриемка");

	Возврат СтруктураДействий;

КонецФункции

// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Изменяемая форма, содержит в том числе:
// 		* Объект - ДокументОбъект - 
// 		* Элементы - ЭлементыФормы - 
// 
Процедура УправлениеДоступностью(Форма) Экспорт
	
	ВлияющиеРеквизитыДоступны = Форма.ДокументыОснования.Количество() = 0;
	
	Если ТипОснованияПеремещениеТоваров(Форма.Объект.Ссылка) Тогда
		
		ПодборДокументовОснованийДоступен = ЗначениеЗаполнено(Форма.Объект.СкладОтправитель)
		                                    И ЗначениеЗаполнено(Форма.Объект.СкладПолучатель)
		                                    И ЗначениеЗаполнено(Форма.Объект.Организация);
		
	ИначеЕсли РасхожденияКлиентСервер.ТипОснованияРеализацияТоваровУслуг(Форма.Объект.ТипОснованияАктаОРасхождении) Тогда
		
		ПодборДокументовОснованийДоступен = (Не Форма.ИспользоватьСоглашенияСКлиентами Или ЗначениеЗаполнено(Форма.Объект.Соглашение))
		                                    И ЗначениеЗаполнено(Форма.Объект.Партнер)
		                                    И ЗначениеЗаполнено(Форма.Объект.Контрагент)
		                                    И ЗначениеЗаполнено(Форма.Объект.Организация)
		                                    И ?(Форма.Элементы.Договор.Видимость И Форма.ИспользоватьСоглашенияСКлиентами,
		                                        ЗначениеЗаполнено(Форма.Объект.Договор), Истина)
		                                    И ЗначениеЗаполнено(Форма.Объект.Валюта)
		                                    И (ЗначениеЗаполнено(Форма.Объект.НалогообложениеНДС)
		                                        Или Форма.Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию")
		                                        Или Форма.Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи"))
		                                    И ЗначениеЗаполнено(Форма.Объект.ХозяйственнаяОперация);
		
	ИначеЕсли ТипОснованияОтгрузкаТоваровСХранения(Форма.Объект.ТипОснованияАктаОРасхождении)
		Или ТипОснованияПередачаТоваровХранителю(Форма.Объект.ТипОснованияАктаОРасхождении)
		Или ТипОснованияПоступлениеТоваровОтХранителя(Форма.Объект.ТипОснованияАктаОРасхождении)
		Или ТипОснованияПередачаНаКомиссию(Форма.Объект.ТипОснованияАктаОРасхождении)
		Или ТипОснованияВозвратОтКомиссионера(Форма.Объект.ТипОснованияАктаОРасхождении)
		Или Форма.Объект.ТипОснованияАктаОРасхождении = ПредопределенноеЗначение("Перечисление.ТипыОснованияАктаОРасхождении.ПриемкаТоваровНаХранение") Тогда
		
		ПодборДокументовОснованийДоступен = ?(ТипОснованияПередачаТоваровХранителю(Форма.Объект.ТипОснованияАктаОРасхождении),
												Не Форма.ИспользоватьСоглашенияСКлиентами
													Или ЗначениеЗаполнено(Форма.Объект.Соглашение),
												Истина)
							И ЗначениеЗаполнено(Форма.Объект.Партнер)
							И ЗначениеЗаполнено(Форма.Объект.Контрагент)
							И ЗначениеЗаполнено(Форма.Объект.Организация)
							И ЗначениеЗаполнено(Форма.Объект.Валюта)
							И ЗначениеЗаполнено(Форма.Объект.ХозяйственнаяОперация)
							И ?(ТипОснованияВозвратОтКомиссионера(Форма.Объект.ТипОснованияАктаОРасхождении),
								ЗначениеЗаполнено(Форма.Объект.Договор), Истина);
		
	Иначе
		
		ПодборДокументовОснованийДоступен = ЗначениеЗаполнено(Форма.Объект.Партнер)
		                                    И ЗначениеЗаполнено(Форма.Объект.Контрагент)
		                                    И ЗначениеЗаполнено(Форма.Объект.Организация)
		                                    И ЗначениеЗаполнено(Форма.Объект.Валюта)
		                                    И (ЗначениеЗаполнено(Форма.Объект.НалогообложениеНДС)
		                                        Или Форма.Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера")
		                                        Или Форма.Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратОтХранителя"))
		                                    И ЗначениеЗаполнено(Форма.Объект.ХозяйственнаяОперация);
		
	КонецЕсли;
	
	ПодборТоваровДоступен = ПодборДокументовОснованийДоступен И (Форма.ДокументыОснования.Количество() > 0);
	
	Форма.Элементы.Организация.ТолькоПросмотр           = НЕ ВлияющиеРеквизитыДоступны;
	
	Если Не ТипОснованияПеремещениеТоваров(Форма.Объект.Ссылка) Тогда
		
		Форма.Элементы.Партнер.ТолькоПросмотр               = НЕ ВлияющиеРеквизитыДоступны;
		Форма.Элементы.Контрагент.ТолькоПросмотр            = НЕ ВлияющиеРеквизитыДоступны;
		Форма.Элементы.Соглашение.ТолькоПросмотр            = НЕ ВлияющиеРеквизитыДоступны;
		Форма.Элементы.Договор.ТолькоПросмотр               = НЕ ВлияющиеРеквизитыДоступны;
		Форма.Элементы.Валюта.ТолькоПросмотр                = НЕ ВлияющиеРеквизитыДоступны;
		Форма.Элементы.ЦенаВключаетНДС.ТолькоПросмотр       = НЕ ВлияющиеРеквизитыДоступны;
		Форма.Элементы.НалогообложениеНДС.ТолькоПросмотр    = НЕ ВлияющиеРеквизитыДоступны;
		Форма.Элементы.ХозяйственнаяОперация.ТолькоПросмотр = НЕ ВлияющиеРеквизитыДоступны;
		Форма.Элементы.ХозяйственнаяОперация.ТолькоПросмотр = НЕ ВлияющиеРеквизитыДоступны
									Или ТипОснованияОтгрузкаТоваровСХранения(Форма.Объект.ТипОснованияАктаОРасхождении)
									Или ТипОснованияПередачаТоваровХранителю(Форма.Объект.ТипОснованияАктаОРасхождении)
									Или Форма.Объект.ТипОснованияАктаОРасхождении = ПредопределенноеЗначение("Перечисление.ТипыОснованияАктаОРасхождении.ПриемкаТоваровНаХранение");
		
	КонецЕсли;
	
	ЭлементИзменитьДокументыОснования     = Форма.Элементы.ИзменитьДокументыОснования; // ДекорацияФормы
	ЭлементТоварыЗаполнитьПоОснованиям    = Форма.Элементы.ТоварыЗаполнитьПоОснованиям; // КнопкаКоманднойПанели
	ЭлементТоварыЗагрузитьИзВнешнегоФайла = Форма.Элементы.ТоварыЗагрузитьИзВнешнегоФайла; // КнопкаКоманднойПанели
	ЭлементТоварыОткрытьПодбор            = Форма.Элементы.ТоварыОткрытьПодбор; // КнопкаКоманднойПанели
	ЭлементТоварыДобавить                 = Форма.Элементы.ТоварыДобавить; // КнопкаКоманднойПанели
	ЭлементТовары                         = Форма.Элементы.Товары; // КнопкаКоманднойПанели
	
	ЭлементИзменитьДокументыОснования.Доступность     = ПодборДокументовОснованийДоступен;
	ЭлементТоварыЗаполнитьПоОснованиям.Доступность    = ПодборТоваровДоступен;
	ЭлементТоварыЗагрузитьИзВнешнегоФайла.Доступность = ПодборТоваровДоступен;
	ЭлементТоварыОткрытьПодбор.Доступность            = ПодборТоваровДоступен;
	ЭлементТоварыДобавить.Доступность                 = ПодборТоваровДоступен;
	ЭлементТовары.Доступность                         = ПодборТоваровДоступен;
	
	Если ТипОснованияПеремещениеТоваров(Форма.Объект.Ссылка) Тогда
		// Не обрабатывается
	ИначеЕсли РасхожденияКлиентСервер.ТипОснованияРеализацияТоваровУслуг(Форма.Объект.ТипОснованияАктаОРасхождении) Тогда 
		
		УправлениеСпособомОтраженияРасхожденияРеализация(Форма);
		
	ИначеЕсли РасхожденияКлиентСервер.ТипОснованияПриобретениеТоваровУслуг(Форма.Объект.ТипОснованияАктаОРасхождении) Тогда
		
		УправлениеСпособомОтраженияРасхожденияПриобретение(Форма);
		
	КонецЕсли;
	
	НадписьОформитьДокументы = Форма.Элементы.ОформитьДокументы;//РасширениеДекорацииФормыДляНадписи
	
	Если (Форма.СтрокиАктаСодержатДействияТребующиеОбработки
	      И ЗначениеЗаполнено(Форма.Объект.СпособОтраженияРасхождений)
	      И (Форма.Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыАктаОРасхождениях.КВыполнению")
	      Или Форма.Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыАктаОРасхождениях.Отработано"))) Тогда
	      	
		НадписьОформитьДокументы.Гиперссылка = Истина;
		НадписьОформитьДокументы.Заголовок   = НСтр("ru = 'Оформить документы'");
		НадписьОформитьДокументы.Доступность = Истина;
		
	Иначе
		
		НадписьОформитьДокументы.Гиперссылка = Ложь;
		НадписьОформитьДокументы.Доступность = Ложь;
		
		НадписьОформитьДокументы.Заголовок  = НСтр("ru = 'Оформление документов доступно при наличии расхождений в статусах ""Отрабатывается"" и ""Отработано""'");
		
	КонецЕсли;
	
	СобытияФормКлиентСервер.ПриИзмененииЭлемента(Форма, Форма.Элементы.ОформитьДокументы.Имя);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
	                                                             "ТоварыЗаполнитьФактПоПриемке",
	                                                             "Доступность",
	                                                             Форма.Объект.Товары.Количество() > 0);
	
	ЭлементТоварыИзменитьДействие = Форма.Элементы.ТоварыИзменитьДействие; // КнопкаКоманднойПанели
	
	ЭлементТоварыИзменитьДействие.Доступность = Форма.ЕстьИзлишки Или Форма.ЕстьНедостачи;
	
КонецПроцедуры

// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Изменяемая форма
// 
Процедура УправлениеСпособомОтраженияРасхожденияПриобретение(Форма)
	
	Объект                        = Форма.Объект;
	Элементы                      = Форма.Элементы;
	ДоступныеСпособыОтработкиАкта = Форма.ДоступныеСпособыОтработкиАкта;
	
	Если Не (Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика")
			Или Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути")
			Или Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаНеотфактурованнаяПоставка")
			Или Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаФактуровкаПоставки")) Тогда
				
		Элементы.СпособОтраженияРасхожденийИзменениеДокумента.Видимость = Истина;
		Элементы.СпособОтраженияРасхожденийКорректировкаПоступления.Видимость = Ложь;
		Элементы.ГруппаИнформацияОДоступностиСпособаОтражения.Видимость = Ложь;	
		
	Иначе
		
		Элементы.СпособОтраженияРасхожденийИзменениеДокумента.Доступность = 
			ДоступныеСпособыОтработкиАкта.НайтиПоЗначению(
				ПредопределенноеЗначение("Перечисление.СпособыОтраженияАктовОРасхожденияПослеПоступления.ИсправлениеПервичныхДокументов")) <> Неопределено;
		
		Элементы.СпособОтраженияРасхожденийКорректировкаПоступления.Доступность = 
			ДоступныеСпособыОтработкиАкта.НайтиПоЗначению(
				ПредопределенноеЗначение("Перечисление.СпособыОтраженияАктовОРасхожденияПослеПоступления.ОформлениеКорректировокПоступления")) <> Неопределено;
		
	КонецЕсли;
	
	ТребуетсяСообщениеОНесоответствииСпособа = Ложь;
	ОпределитьНеобходимостьОНесоответствииСпособа(Объект, ДоступныеСпособыОтработкиАкта, ТребуетсяСообщениеОНесоответствииСпособа);
	
	ТекстПояснения = ТекстПоясненияСпособОтработкиАктПослеПриобретения(Форма, ТребуетсяСообщениеОНесоответствииСпособа);
	НастроитьЭлементыФормыСпособОтражения(Объект, Элементы, ТребуетсяСообщениеОНесоответствииСпособа, ТекстПояснения);
	
КонецПроцедуры

Процедура ОпределитьНеобходимостьОНесоответствииСпособа(Объект, ДоступныеСпособыОтработкиАкта, ТребуетсяСообщениеОНесоответствииСпособа);
	
	Если ЗначениеЗаполнено(Объект.СпособОтраженияРасхождений)
		И ДоступныеСпособыОтработкиАкта.НайтиПоЗначению(Объект.СпособОтраженияРасхождений) = Неопределено Тогда
			
		Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыАктаОРасхождениях.Отработано")
			Или Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыАктаОРасхождениях.КВыполнению") Тогда
			
			ТребуетсяСообщениеОНесоответствииСпособа = Истина;
			
		Иначе
		
			Если ДоступныеСпособыОтработкиАкта.Количество() = 0 Тогда
				Объект.СпособОтраженияРасхождений = Неопределено;
			Иначе
				Объект.СпособОтраженияРасхождений = ДоступныеСпособыОтработкиАкта[0].Значение;
			КонецЕсли;
				
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура НастроитьЭлементыФормыСпособОтражения(Объект, Элементы, ТребуетсяСообщениеОНесоответствииСпособа, ТекстПояснения)
	
	Элементы.ГруппаИнформацияОДоступностиСпособаОтражения.Видимость = Не ПустаяСтрока(ТекстПояснения);
	
	ЭлементИнформацияОДоступностиСпособаОтражения = Элементы.ИнформацияОДоступностиСпособаОтражения; // ДекорацияФормы
	ЭлементГруппаСпособОтражения = Элементы.ГруппаСпособОтражения; // ГруппаФормы
	
	ЭлементИнформацияОДоступностиСпособаОтражения.Заголовок       = ТекстПояснения;
	
	ЭлементГруппаСпособОтражения.Доступность = Не (Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыАктаОРасхождениях.Отработано")
	                                            Или Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыАктаОРасхождениях.КВыполнению"));
	
	Если ТребуетсяСообщениеОНесоответствииСпособа Тогда
		Элементы.СтраницыИнформацияСпособыОтражения.ТекущаяСтраница = Элементы.СтраницаПроблемаИнформацияСпособОтражения;
	Иначе
		Элементы.СтраницыИнформацияСпособыОтражения.ТекущаяСтраница = Элементы.СтраницаОбычнаяИнформацияСпособОтражения;
	КонецЕсли;
	
КонецПроцедуры

Процедура УправлениеСпособомОтраженияРасхожденияРеализация(Форма)

	Объект                        = Форма.Объект;
	Элементы                      = Форма.Элементы;
	ДоступныеСпособыОтработкиАкта = Форма.ДоступныеСпособыОтработкиАкта;

	Если Не Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.РеализацияКлиенту") Тогда
		
		Элементы.СпособОтраженияРасхожденийИзменениеДокумента.Видимость       = Истина;
		Элементы.СпособОтраженияРасхожденийКорректировкаИсправление.Видимость = Ложь;
		Элементы.СпособОтраженияРасхожденийКорректировкаПоСогласованию.Видимость = Ложь;

		Элементы.СпособОтраженияРасхожденийКорректировкаНовые.Видимость       = Ложь;
		Элементы.ГруппаИнформацияОДоступностиСпособаОтражения.Видимость       = Ложь;
		
	Иначе

		Элементы.СпособОтраженияРасхожденийИзменениеДокумента.Доступность = 
			ДоступныеСпособыОтработкиАкта.НайтиПоЗначению(
				ПредопределенноеЗначение("Перечисление.СпособыОтраженияРасхожденийАктПриемкиКлиента.ИсправлениеПервичныхДокументов")) <> Неопределено;

		Элементы.СпособОтраженияРасхожденийКорректировкаИсправление.Доступность = 
			ДоступныеСпособыОтработкиАкта.НайтиПоЗначению(
				ПредопределенноеЗначение("Перечисление.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов")) <> Неопределено;
				
		Элементы.СпособОтраженияРасхожденийКорректировкаПоСогласованию.Доступность = 
			ДоступныеСпособыОтработкиАкта.НайтиПоЗначению(
				ПредопределенноеЗначение("Перечисление.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиПоСогласованию")) <> Неопределено;
		
		Элементы.СпособОтраженияРасхожденийКорректировкаНовые.Доступность = 
			ДоступныеСпособыОтработкиАкта.НайтиПоЗначению(
				ПредопределенноеЗначение("Перечисление.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировокКакНовыеПервичныеДокументы")) <> Неопределено;
			
	КонецЕсли;
	
	ТребуетсяСообщениеОНесоответствииСпособа = Ложь;
	ОпределитьНеобходимостьОНесоответствииСпособа(Объект, ДоступныеСпособыОтработкиАкта, ТребуетсяСообщениеОНесоответствииСпособа);
	
	ТекстПояснения = ТекстПоясненияСпособОтработкиАктПослеРеализации(Форма, ТребуетсяСообщениеОНесоответствииСпособа);
	НастроитьЭлементыФормыСпособОтражения(Объект, Элементы, ТребуетсяСообщениеОНесоответствииСпособа, ТекстПояснения);

КонецПроцедуры

Функция ТекстПоясненияСпособОтработкиАктПослеПриобретения(Форма, ТребуетсяСообщениеОНесоответствииСпособа)

	ТекстПояснения = "";
	
	Если Форма.ДоступныеСпособыОтработкиАктаПоСостояниюЭДО.НайтиПоЗначению(
		ПредопределенноеЗначение("Перечисление.СпособыОтраженияАктовОРасхожденияПослеПоступления.ИсправлениеПервичныхДокументов")) = Неопределено Тогда
			
		Если Не Форма.ИспользоватьКорректировкиПриобретений  Тогда
	
			ТекстПояснения = НСтр("ru = 'Электронный документ по приобретению подтвержден. Возможна только корректировка приобретения,
			                     |но их использование отключено.'");
			                             
		Иначе
			
			ТекстПояснения = НСтр("ru = 'Электронный документ по приобретению подтвержден. Возможна только корректировка приобретения.'");
			
		КонецЕсли;
		
	КонецЕсли;
		
	Если Форма.ДоступныеСпособыОтработкиАктаПоСостояниюЭДО.НайтиПоЗначению(
			ПредопределенноеЗначение("Перечисление.СпособыОтраженияАктовОРасхожденияПослеПоступления.ОформлениеКорректировокПоступления")) = Неопределено 
			И Форма.ИспользоватьКорректировкиПриобретений Тогда
			
			ТекстПояснения = НСтр("ru = 'Электронный документ по приобретению был отклонен. Возможно только изменение поступления.'");
	
	КонецЕсли;
	
	Если ТребуетсяСообщениеОНесоответствииСпособа Тогда
		
		СообщениеОНесоответствииСпособа = НСтр("ru = 'Текущий способ отражения некорректен. Изменить его можно в статусе ""Не согласовано"" или ""Обеспечивается""'");
		
		ТекстПояснения = ТекстПояснения + Символы.ПС + СообщениеОНесоответствииСпособа;
	
	КонецЕсли;

	Возврат ТекстПояснения;

КонецФункции

Функция ТекстПоясненияСпособОтработкиАктПослеРеализации(Форма, ТребуетсяСообщениеОНесоответствииСпособа)

	ТекстПояснения = "";

	Если Форма.ДоступныеСпособыОтработкиАктаПоСостояниюЭДО.Количество() = 0 Тогда
			
		Если (Форма.СтатусЭДООснования = "ВОбработке"
			Или Форма.СтатусЭДООснования = "Получен"
			Или Форма.СтатусЭДООснования = "ОтклонениеВОбработке"
			Или Форма.СтатусЭДООснования = "УтверждениеВОбработке")Тогда
		
			ТекстПояснения = НСтр("ru = 'Документ-основание участвует в ЭДО, но покупатель пока ни отклонил, ни подтвердил документ.
			                             |Отработка расхождений недоступна.'");
		
		КонецЕсли;
			
	ИначеЕсли Форма.ДоступныеСпособыОтработкиАктаПоСостояниюЭДО.НайтиПоЗначению(
				ПредопределенноеЗначение("Перечисление.СпособыОтраженияРасхожденийАктПриемкиКлиента.ИсправлениеПервичныхДокументов")) = Неопределено Тогда
				
		Если Не Форма.ИспользоватьКорректировкиРеализаций  Тогда
	
			ТекстПояснения = НСтр("ru = 'Электронный документ по реализации подтвержден покупателем. Возможна только корректировка реализации,
			                             |но их использование отключено.'");
			                             
		Иначе
			
			ТекстПояснения = НСтр("ru = 'Электронный документ по реализации подтвержден покупателем. Возможна только корректировка реализации.'");
			
		КонецЕсли;
		
	ИначеЕсли Форма.ДоступныеСпособыОтработкиАктаПоСостояниюЭДО.НайтиПоЗначению(
				ПредопределенноеЗначение("Перечисление.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов")) = Неопределено 
			И Форма.ДоступныеСпособыОтработкиАктаПоСостояниюЭДО.НайтиПоЗначению(
				ПредопределенноеЗначение("Перечисление.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировокКакНовыеПервичныеДокументы")) = Неопределено 
			И Форма.ИспользоватьКорректировкиРеализаций Тогда
				
			ТекстПояснения = НСтр("ru = 'Электронный документ по реализации отклонен покупателем. Возможно только изменение реализации.'");
		
	КонецЕсли;
	
	Если ТребуетсяСообщениеОНесоответствииСпособа Тогда
		
		СообщениеОНесоответствииСпособа = НСтр("ru = 'Текущий способ отражения некорректен. Изменить его можно в статусе ""Не согласовано"" или ""Обеспечивается""'");
		
		ТекстПояснения = ТекстПояснения + Символы.ПС + СообщениеОНесоответствииСпособа;
	
	КонецЕсли;

	Возврат ТекстПояснения;

КонецФункции

Процедура ЗаполнитьДокументОснованиеВСтроке(СтрокаТаблицыТовары, ДокументыОснования) Экспорт

	Если Не СтрокаТаблицыТовары.ЗаполненоПоОснованию И Не ЗначениеЗаполнено(СтрокаТаблицыТовары.ДокументОснование) Тогда
		Если ДокументыОснования.Количество() = 1 Тогда
			СтрокаТаблицыТовары.ДокументОснование = ДокументыОснования[0].ДокументОснование;
			УстановитьПризнакОснованиеПоЗаказам(СтрокаТаблицыТовары, ДокументыОснования[0]);
			ЗаполнитьЗаказВСтроке(СтрокаТаблицыТовары, ДокументыОснования);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьЗаказВСтроке(СтрокаТаблицыТовары, ДокументыОснования) Экспорт

	НайденныеСтроки = ДокументыОснования.НайтиСтроки(Новый Структура("ДокументОснование", СтрокаТаблицыТовары.ДокументОснование));
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	НайденнаяСтрока = НайденныеСтроки[0];

	Если Не ЗначениеЗаполнено(СтрокаТаблицыТовары.Заказ) Тогда
		Если НайденнаяСтрока.ЗаказыОснования.Количество() = 1 Тогда
			СтрокаТаблицыТовары.Заказ = НайденнаяСтрока.ЗаказыОснования.Получить(0).Значение;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьПризнакОснованиеПоЗаказам(СтрокаТаблицыТовары, СтрокаДокументыОснования) Экспорт
	
	СтрокаТаблицыТовары.ОснованиеПоЗаказам = (СтрокаДокументыОснования.ЗаказыОснования.Количество() > 0);
	
КонецПроцедуры

Процедура УстановитьОтборСтатусаДинамическогоСписка(ДинамическийСписок, СтатусДляОтбора) Экспорт
	
	УстанавливаетсяОтбор = ЗначениеЗаполнено(СтатусДляОтбора);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДинамическийСписок, 
	                                                                        "Статус",
	                                                                        СтатусДляОтбора, 
	                                                                        ВидСравненияКомпоновкиДанных.Равно,
	                                                                        ,
	                                                                        УстанавливаетсяОтбор);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДинамическийСписок, 
	                                                                        "Проведен",
	                                                                        Истина, 
	                                                                        ВидСравненияКомпоновкиДанных.Равно,
	                                                                        ,
	                                                                        УстанавливаетсяОтбор);
	
КонецПроцедуры

Процедура ЗаполнитьСделкуВСтроке(ТекущиеДанные, ЗаказыСделки) Экспорт

	Если ТекущиеДанные.ОснованиеПоЗаказам И ЗначениеЗаполнено(ТекущиеДанные.ЗаказПоставщику) Тогда
		
		НайденныеСтроки = ЗаказыСделки.НайтиСтроки(Новый Структура("ЗаказПоставщику", ТекущиеДанные.ЗаказПоставщику));
		Если НайденныеСтроки.Количество() > 0 Тогда
			ТекущиеДанные.Сделка = НайденныеСтроки[0].Сделка;
			Возврат;
		КонецЕсли;
	
	КонецЕсли;
	
	ТекущиеДанные.Сделка = ПредопределенноеЗначение("Справочник.СделкиСКлиентами.ПустаяСсылка");
	
КонецПроцедуры

Функция ИменаРеквизитовВЗависимостиОтТипаАкта(ЭтоАктОРасхожденияхПослеОтгрузки) Экспорт
	
	СтруктураИмен = Новый Структура;
	СтруктураИмен.Вставить("ЗаполненоПоОснованию", ?(ЭтоАктОРасхожденияхПослеОтгрузки,"ЗаполненоПоРеализации","ЗаполненоПоОснованию"));
	СтруктураИмен.Вставить("Основание", ?(ЭтоАктОРасхожденияхПослеОтгрузки,"Реализация","ДокументОснование"));
	СтруктураИмен.Вставить("Заказ", ?(ЭтоАктОРасхожденияхПослеОтгрузки,"ЗаказКлиента","ЗаказПоставщику"));
	СтруктураИмен.Вставить("ОснованиеПоЗаказам", ?(ЭтоАктОРасхожденияхПослеОтгрузки,"РеализацияПоЗаказам","ОснованиеПоЗаказам"));
	
	Возврат СтруктураИмен;
	
КонецФункции

Процедура РассчитатьИтоговыеПоказателиФормы(Форма) Экспорт

	Форма.Недостачи = 0;
	Форма.Излишки   = 0;
	Форма.ЕстьИзлишки     = Ложь;
	Форма.ЕстьНедостачи   = Ложь;
	
	Для Каждого СтрокаТовары Из Форма.Объект.Товары Цикл
		Если СтрокаТовары.СуммаРасхождения > 0 Тогда
			Форма.Излишки = Форма.Излишки + СтрокаТовары.СуммаРасхождения;
		ИначеЕсли СтрокаТовары.СуммаРасхождения < 0 Тогда
			Форма.Недостачи = Форма.Недостачи + (-СтрокаТовары.СуммаРасхождения);
		КонецЕсли;
		Если СтрокаТовары.КоличествоУпаковокРасхождения < 0 Тогда 
			Форма.ЕстьНедостачи   = Истина;
		КонецЕсли;
		Если СтрокаТовары.КоличествоУпаковокРасхождения > 0 Тогда 
			Форма.ЕстьИзлишки   = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Форма.Расхождения = Форма.Объект.Товары.Итог("Сумма") - Форма.Объект.Товары.Итог("СуммаПоДокументу");
	
КонецПроцедуры

Функция ЭтоАктОРасхожденияхПослеОтгрузки(ТипОснованияАктаОРасхождении) Экспорт
	
	Возврат ТипОснованияРеализацияТоваровУслуг(ТипОснованияАктаОРасхождении)
		Или ТипОснованияОтгрузкаТоваровСХранения(ТипОснованияАктаОРасхождении)
		Или ТипОснованияПередачаТоваровХранителю(ТипОснованияАктаОРасхождении)
		Или ТипОснованияВозвратПоставщику(ТипОснованияАктаОРасхождении)
		Или ТипОснованияПередачаНаКомиссию(ТипОснованияАктаОРасхождении);
	
КонецФункции

// Изменить действие в строке.
// 
// Параметры:
// 	Строка - СтрокаТаблицыЗначений - содержит в том числе:
// 		* Действие - ПеречислениеСсылка.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки, ПеречислениеСсылка.ВариантыДействийПоРасхождениямВАктеПослеПриемки -
// 	РезультатВыбораПользователя - Структура -
// 
// Возвращаемое значение:
//  Булево - Изменить действие в строке
Функция ИзменитьДействиеВСтроке(Строка, РезультатВыбораПользователя) Экспорт
	
	Если ЗначениеЗаполнено(РезультатВыбораПользователя.ДействиеНедостачи)
		И Строка.КоличествоУпаковокРасхождения < 0 Тогда
		ВариантДействия = РезультатВыбораПользователя.ДействиеНедостачи;
	Иначе
		ВариантДействия = РезультатВыбораПользователя.ДействиеИзлишки;
	КонецЕсли;
	
	ЕстьРеквизитПоВинеСтороннейКомпании = РезультатВыбораПользователя.Свойство("ПоВинеСтороннейКомпании");
	
	Если Строка.Действие = ВариантДействия Тогда
		Если ЕстьРеквизитПоВинеСтороннейКомпании Тогда
			Если Строка.ПоВинеСтороннейКомпании = РезультатВыбораПользователя.ПоВинеСтороннейКомпании Тогда
				Возврат Ложь;
			КонецЕсли;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ВариантДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ПокупкаПерепоставленного")
		Или ВариантДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ВозвратПерепоставленного")
		Или ВариантДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ОприходоватьСейчас")
		Или ВариантДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ПерепоставленноеДарится")
		Или ВариантДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ВернутьПерепоставленноеБезОформления")
		Или ВариантДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОтнестиПерепоставленноеНаПрочиеДоходы") 
		Или ВариантДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьПерепоставленноеИВернуть")
		Или ВариантДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьПерепоставленное") Тогда
		
		Если НЕ Строка.КоличествоУпаковокРасхождения > 0  Тогда
			Возврат Ложь;
		КонецЕсли;
		
	ИначеЕсли ВариантДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ТребуетсяДопоставка")
		Или ВариантДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ДопоставкаНеТребуется")
		Или ВариантДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ОтгрузитьСейчас")
		Или ВариантДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.НедостачаНеПризнана")
		Или ВариантДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьНедостачу")
		Или ВариантДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьНедостачуИОжидатьДопоставку")
		Или ВариантДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОтнестиНедостачуНаПрочиеРасходы")
		Или ВариантДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОжидатьДопоставкуБезОформления") Тогда
		
		Если НЕ Строка.КоличествоУпаковокРасхождения < 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если (Строка.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга")
		Или Строка.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа")) Тогда
		
		Если ВариантДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ВозвратПерепоставленного")
			Или ВариантДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОтнестиНедостачуНаПрочиеРасходы") 
			Или ВариантДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьПерепоставленноеИВернуть") Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Строка.Действие = ВариантДействия;
	Если ЕстьРеквизитПоВинеСтороннейКомпании Тогда
		Если ВариантДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОтнестиНедостачуНаПрочиеРасходы") Тогда
			Строка.ПоВинеСтороннейКомпании =  РезультатВыбораПользователя.ПоВинеСтороннейКомпании;
		Иначе
			Строка.ПоВинеСтороннейКомпании =  Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Заполняет реквизиты строки для многооборотной тары
// 
// Параметры:
// 	Форма - ДанныеФормыСтруктура - Форма, в которой необходимо заполнить информацию
// 	ДокументыОснования - ДинамическийСписок - Документы, откуда необходимо взять информацию. Должны содержать:
// 		* ВернутьМногооборотнуюТару - Булево - 
// 		* ТребуетсяЗалогЗаТару - Булево - 
//
Процедура ЗаполнитьРеквизитыМногооборотнойТары(Форма, ДокументыОснования) Экспорт
	
	ТекущийДокументОснования = Неопределено;
	НайденнаяСтрока = Неопределено;
	Для каждого СтрокаТаблицыТовары Из Форма.Товары Цикл
		
		Если ТекущийДокументОснования <> СтрокаТаблицыТовары.Реализация Тогда
			ТекущийДокументОснования = СтрокаТаблицыТовары.Реализация;
			НайденныеСтроки = ДокументыОснования.НайтиСтроки(Новый Структура("Реализация", ТекущийДокументОснования));		
			Если НайденныеСтроки.Количество() > 0 Тогда
				НайденнаяСтрока = НайденныеСтроки[0];
			иначе	
				НайденнаяСтрока = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		Если НайденнаяСтрока <> Неопределено Тогда
			ЗаполнитьРеквизитыМногооборотнойТарыВСтроке(СтрокаТаблицыТовары, НайденнаяСтрока);		
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыМногооборотнойТарыВСтроке(СтрокаТаблицыТовары, СтрокаДокументыОснования) Экспорт
	
	СтрокаТаблицыТовары.ВернутьМногооборотнуюТару = СтрокаДокументыОснования.ВернутьМногооборотнуюТару;
	СтрокаТаблицыТовары.ТребуетсяЗалогЗаТару 	  = СтрокаДокументыОснования.ТребуетсяЗалогЗаТару;	
	
КонецПроцедуры


#КонецОбласти
